hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timerb.c
#define IS_TIMERB_CMP_EVT_STATE(x)                                             \
(   (TIMERB_CMP_EVT_ENABLE == (x))              ||                             \
    (TIMERB_CMP_EVT_DISABLE == (x)))

#define IS_TIMERB_FUNC_MODE(x)                                                 \
(   (TIMERB_INPUT_CAPTURE == (x))               ||                             \
    (TIMERB_OUTPUT_COMPARE == (x)))

#define IS_TIMERB_IC_NOISE_FILTER_CLKDIV(x)                                    \
(   (TIMERB_IC_NOFICLKDIV_NONE == (x))          ||                             \
    (TIMERB_IC_NOFICLKDIV_DIV1 == (x))          ||                             \
    (TIMERB_IC_NOFICLKDIV_DIV4 == (x))          ||                             \
    (TIMERB_IC_NOFICLKDIV_DIV16 == (x))         ||                             \
    (TIMERB_IC_NOFICLKDIV_DIV64 == (x)))

#define IS_TIMERB_OC_START_CNT_OUTPUT_POLARITY(x)                              \
(   (TIMERB_OC_STARTCNT_OUTPUT_LOW == (x))      ||                             \
    (TIMERB_OC_STARTCNT_OUTPUT_HIGH == (x))     ||                             \
    (TIMERB_OC_STARTCNT_OUTPUT_HOLD == (x)))

#define IS_TIMERB_OC_STOP_CNT_OUTPUT_POLARITY(x)                               \
(   (TIMERB_OC_STOPCNT_OUTPUT_LOW == (x))       ||                             \
    (TIMERB_OC_STOPCNT_OUTPUT_HIGH == (x))      ||                             \
    (TIMERB_OC_STOPCNT_OUTPUT_HOLD == (x)))

#define IS_TIMERB_OC_CMPMATCH_OUTPUT_POLARITY(x)                               \
(   (TIMERB_OC_CMPMATCH_OUTPUT_LOW == (x))      ||                             \
    (TIMERB_OC_CMPMATCH_OUTPUT_HIGH == (x))     ||                             \
    (TIMERB_OC_CMPMATCH_OUTPUT_HOLD == (x))     ||                             \
    (TIMERB_OC_CMPMATCH_OUTPUT_INVERTED == (x)))

#define IS_TIMERB_OC_PERIODMATCH_OUTPUT_POLARITY(x)                            \
(   (TIMERB_OC_PERIODMATCH_OUTPUT_LOW == (x))   ||                             \
    (TIMERB_OC_PERIODMATCH_OUTPUT_HIGH == (x))  ||                             \
    (TIMERB_OC_PERIODMATCH_OUTPUT_HOLD == (x))  ||                             \
    (TIMERB_OC_PERIODMATCH_OUTPUT_INVERTED == (x)))

#define IS_TIMERB_OC_FORCE_OUTPUT_POLARITY(x)                                  \
(   (TIMERB_OC_FORCE_OUTPUT_LOW == (x))         ||                             \
    (TIMERB_OC_FORCE_OUTPUT_HIGH == (x))        ||                             \
    (TIMERB_OC_FORCE_OUTPUT_INVALID == (x)))

#define IS_TIMERB_OC_PORT_OUTPUT_STATE(x)                                      \
(   (TIMERB_OC_PORT_OUTPUT_ENABLE == (x))       ||                             \
    (TIMERB_OC_PORT_OUTPUT_DISABLE == (x)))

#define IS_TIMERB_IC_CAPTURE_CONDITION(x)   ((!((x) & ((uint16_t)(~TMRB_CCONR_HICP)))) || ((x) == TIMERB_IC_INVALID))

#define IS_TIMERB_IC_HSTART_CONDITION(x)    ((!((x) & ((uint16_t)(~TMRB_HCONR_HSTA)))) || ((x) == TIMERB_HWSTART_INVALID))

#define IS_TIMERB_IC_HSTOP_CONDITION(x)     ((!((x) & ((uint16_t)(~TMRB_HCONR_HSTP)))) || ((x) == TIMERB_HWSTOP_INVALID))

#define IS_TIMERB_IC_HCLEAR_CONDITION(x)    ((!((x) & ((uint16_t)(~TMRB_HCONR_HCLE)))) || ((x) == TIMERB_HWCLEAR_INVALID))

#define IS_TIMERB_IC_HCUP_CONDITION(x)      ((!((x) & ((uint16_t)(~TMRB_HCUPR_HCUP)))) || ((x) == TIMERB_HWUP_INVALID))

#define IS_TIMERB_IC_HCDOWN_CONDITION(x)    ((!((x) & ((uint16_t)(~TMRB_HCDOR_HCDO)))) || ((x) == TIMERB_HWDOWN_INVALID))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/** 
 * @defgroup TIMERB_Global_Functions TimerB Global Functions
 * @{
 */

/**
 * @brief  Initialize TimerB base function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_timerb_init_t structure (TMRBx unit base function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance or pstcInit = NULL
 */
en_result_t TIMERB_Init(M0P_TMRB_TypeDef *TMRBx,
                            const stc_timerb_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance and pstcInit */
    if ((IS_TIMERB_INSTANCE(TMRBx)) && (NULL != pstcInit))
    {
        /* Check parameters */
        DDL_ASSERT(0u != pstcInit->u16PeriodVal);
        DDL_ASSERT(IS_TIMERB_CNT_MODE(pstcInit->u16CntMode));
        DDL_ASSERT(IS_TIMERB_CLOCK_DIV(pstcInit->u16ClkDiv));
        DDL_ASSERT(IS_TIMERB_CNT_DIRECTION(pstcInit->u16CntDir));
        DDL_ASSERT(IS_TIMERB_OVERFLOW_STATE(pstcInit->u16OverflowAction));
        DDL_ASSERT(IS_TIMERB_SYNC_START_STATE(pstcInit->u16SynStartState));

        WRITE_REG16(TMRBx->CNTER, 0u);
        WRITE_REG16(TMRBx->PERAR, pstcInit->u16PeriodVal);
        MODIFY_REG16(TMRBx->BCSTR,                                             \
                     (TMRB_BCSTR_DIR   | TMRB_BCSTR_MODE  |                    \
                      TMRB_BCSTR_SYNST | TMRB_BCSTR_CKDIV | TMRB_BCSTR_OVSTP), \
                     (pstcInit->u16CntDir        | pstcInit->u16CntMode |      \
                      pstcInit->u16SynStartState | pstcInit->u16ClkDiv  |      \
                      pstcInit->u16OverflowAction));

        /* Set hardware trigger event */
        WRITE_REG16(TMRBx->HCONR,                                              \
                    (pstcInit->u16HwStartCondition |                           \
                     pstcInit->u16HwStopCondition  |                           \
                     pstcInit->u16HwClearCondition));
        WRITE_REG16(TMRBx->HCUPR, pstcInit->u16HwUpCondition);
        WRITE_REG16(TMRBx->HCDOR, pstcInit->u16HwDownCondition);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_timerb_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_timerb_init_t structure (TMRBx unit base function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TIMERB_StructInit(stc_timerb_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (NULL != pstcInit)
    {
        pstcInit->u16PeriodVal = 0xFFFFu;
        pstcInit->u16CntDir = TIMERB_CNT_UP;
        pstcInit->u16CntMode = TIMERB_SAWTOOTH_WAVE;
        pstcInit->u16SynStartState = TIMERB_SYNC_START_DISABLE;
        pstcInit->u16ClkDiv = TIMERB_CLKDIV_DIV1;
        pstcInit->u16OverflowAction = TIMERB_OVERFLOW_COUNT;
        pstcInit->u16HwStartCondition = TIMERB_HWSTART_INVALID;
        pstcInit->u16HwStopCondition = TIMERB_HWSTOP_INVALID;
        pstcInit->u16HwClearCondition = TIMERB_HWCLEAR_INVALID;
        pstcInit->u16HwUpCondition = TIMERB_HWUP_INVALID;
        pstcInit->u16HwDownCondition = TIMERB_HWDOWN_INVALID;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize TimerB unit base function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance
 */
en_result_t TIMERB_DeInit(M0P_TMRB_TypeDef *TMRBx)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance */
    if (IS_TIMERB_INSTANCE(TMRBx))
    {
        /* Configures the registers to reset value. */
        WRITE_REG16(TMRBx->CNTER, 0x0000u);
        WRITE_REG16(TMRBx->PERAR, 0xFFFFu);
        WRITE_REG16(TMRBx->BCSTR, 0x0002u);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set TimerB count direction.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Direction            TimerB count direction
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CNT_UP:        TimerB count up
 *           @arg TIMERB_CNT_DOWN:      TimerB count down
 * @retval None
 */
void TIMERB_SetCntDirection(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Direction)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_CNT_DIRECTION(u16Direction));

    MODIFY_REG16(TMRBx->BCSTR, TMRB_BCSTR_DIR, u16Direction);
}

/**
 * @brief  Get TimerB count direction.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_CNT_UP:        TimerB count up
 *           @arg TIMERB_CNT_DOWN:      TimerB count down
 */
uint16_t TIMERB_GetCntDirection(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

