hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timerb.c
    return enFlag;
}

/**
 * @brief  Clear TimerB flag.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Flag                 TimerB flag type
 *         This parameter can be one of the following values:
 *           @arg TIMERB_FLAG_OVF:      Overflow flag
 *           @arg TIMERB_FLAG_UDF:      Underflow flag
 *           @arg TIMERB_FLAG_CMP:      Compare match flag
 * @retval None
 */
void TIMERB_ClearFlag(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_FLAG(u16Flag));

    switch (u16Flag)
    {
        case TIMERB_FLAG_OVF:
        case TIMERB_FLAG_UDF:
            CLEAR_REG16_BIT(TMRBx->BCSTR, u16Flag);
            break;
        case TIMERB_FLAG_CMP:
            CLEAR_REG16_BIT(TMRBx->STFLR, u16Flag);
            break;
        default:
            break;
    }
}

/**
 * @brief  Enable or disable specified TimerB interrupt.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16IntSource            TimerB interrupt source
 *         This parameter can be one of the following values:
 *           @arg TIMERB_INT_OVF:       Overflow interrupt
 *           @arg TIMERB_INT_UDF:       Underflow interrupt
 *           @arg TIMERB_INT_CMP:       Compare match interrupt
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERB_IntCmd(M0P_TMRB_TypeDef *TMRBx,
                        uint16_t u16IntSource,
                        en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_INT(u16IntSource));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    switch (u16IntSource)
    {
        case TIMERB_IT_OVF:
        case TIMERB_IT_UDF:
            if (Enable == enNewSta)
            {
                SET_REG16_BIT(TMRBx->BCSTR, u16IntSource);
            }
            else
            {
                CLEAR_REG16_BIT(TMRBx->BCSTR, u16IntSource);
            }
            break;
        case TIMERB_IT_CMP:
            if (Enable == enNewSta)
            {
                SET_REG16_BIT(TMRBx->ICONR, u16IntSource);
            }
            else
            {
                CLEAR_REG16_BIT(TMRBx->ICONR, u16IntSource);
            }
            break;
        default:
            break;
    }
}

/**
 * @brief  Set TimerB function mode.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Mode                 TimerB function mode
 *         This parameter can be one of the following values:
 *           @arg TIMERB_INPUT_CAPTURE: Capture input function
 *           @arg TIMERB_OUTPUT_COMPARE:Comare output function
 * @retval None
 */
void TIMERB_SetMode(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_FUNC_MODE(u16Mode));

    MODIFY_REG16(TMRBx->CCONR, TMRB_CCONR_CAPMDA, u16Mode);
}

/**
 * @brief  Get TimerB function mode.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_INPUT_CAPTURE: Capture input function
 *           @arg TIMERB_OUTPUT_COMPARE:Comare output function
 */
uint16_t TIMERB_GetMode(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->CCONR, TMRB_CCONR_CAPMDA);
}

/**
 * @brief  Set TimerB hardware trigger counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Condition            TimerB hardware start counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg @ref TIMERB_Hardware_Start_Count_Condition
 *           @arg @ref TIMERB_Hardware_Stop_Count_Condition
 *           @arg @ref TIMERB_Hardware_Clear_Count_Condition
 * @retval  None
 */
void TIMERB_SetHwTriggerCondition(M0P_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

