hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timerb.c
    WRITE_REG16(TMRBx->HCONR, u16Condition);
}

/**
 * @brief  Set TimerB hardware start counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Condition            TimerB hardware start counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_HWSTART_INVALID:               Hardware start is invalid
 *           @arg TIMERB_HWSTART_TIMB_T_PWM1_RISING:    Hardware start counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                      hardware start counter by rising edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TIMERB_HWSTART_TIMB_T_PWM1_FALLING:   Hardware start counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                      hardware start counter by falling edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TIMERB_HWSTART_TIMB_EVT:              Hardware start counter by the timer TMRB_HTSSR specified event
 * @retval  None
 */
void TIMERB_SetHwStartCondition(M0P_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_HSTART_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCONR, TMRB_HCONR_HSTA, u16Condition);
}

/**
 * @brief  Get TimerB hardware start counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_HWSTART_INVALID:               Hardware start is invalid
 *           @arg TIMERB_HWSTART_TIMB_T_PWM1_RISING:    Hardware start counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                      hardware start counter by rising edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TIMERB_HWSTART_TIMB_T_PWM1_FALLING:   Hardware start counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                      hardware start counter by falling edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TIMERB_HWSTART_TIMB_EVT:              Hardware start counter by the timer TMRB_HTSSR specified event
 */
uint16_t TIMERB_GetHwStartCondition(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->HCONR, TMRB_HCONR_HSTA);
}

/**
 * @brief  Set TimerB hardware stop counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Condition            TimerB hardware stop counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_HWSTOP_INVALID:                Hardware stop is invalid
 *           @arg TIMERB_HWSTOP_TIMB_T_PWM1_RISING:     Hardware stop counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWSTOP_TIMB_T_PWM1_FALLING:    Hardware stop counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWSTOP_TIMB_EVT:               Hardware stop counter by the timer TMRB_HTSSR specified event
 * @retval  None
 */
void TIMERB_SetHwStopCondition(M0P_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_HSTOP_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCONR, TMRB_HCONR_HSTP, u16Condition);
}

/**
 * @brief  Get TimerB hardware stop counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_HWSTOP_INVALID:                Hardware stop is invalid
 *           @arg TIMERB_HWSTOP_TIMB_T_PWM1_RISING:     Hardware stop counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWSTOP_TIMB_T_PWM1_FALLING:    Hardware stop counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWSTOP_TIMB_EVT:               Hardware stop counter by the timer TMRB_HTSSR specified event
 */
uint16_t TIMERB_GetHwStopCondition(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

