hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timerb.c
    return READ_REG16_BIT(TMRBx->HCONR, TMRB_HCONR_HSTP);
}

/**
 * @brief  Set TimerB hardware clear counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Condition            TimerB hardware clear counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_HWCLEAR_INVALID:               Hardware clear is invalid
 *           @arg TIMERB_HWCLEAR_TIMB_T_PWM1_RISING:    Hardware clear counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_TIMB_T_PWM1_FALLING:   Hardware clear counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_EVT:                   Hardware clear counter by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_HWCLEAR_TIMB_N_PWM1_RISING:    Hardware clear counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_TIMB_N_PWM1_FALLING:   Hardware clear counter by the timer TMRB_HTSSR specified event
 * @retval  None
 */
void TIMERB_SetHwClearCondition(M0P_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_HCLEAR_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCONR, TMRB_HCONR_HCLE, u16Condition);
}

/**
 * @brief  Get TimerB hardware clear counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_HWCLEAR_INVALID:               Hardware clear is invalid
 *           @arg TIMERB_HWCLEAR_TIMB_T_PWM1_RISING:    Hardware clear counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_TIMB_T_PWM1_FALLING:   Hardware clear counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_EVT:                   Hardware clear counter by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_HWCLEAR_TIMB_N_PWM1_RISING:    Hardware clear counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_TIMB_N_PWM1_FALLING:   Hardware clear counter by the timer TMRB_HTSSR specified event
 */
uint16_t TIMERB_GetHwClearCondition(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->HCONR, TMRB_HCONR_HCLE);
}

/**
 * @brief  Set TimerB hardware up counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Condition            TimerB hardware up counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_HWUP_INVALID:              Hardware count up is invalid
 *           @arg TIMERB_HWUP_TIMB_T_PWM1_RISING:   Hardware count up by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWUP_TIMB_T_PWM1_FALLING:  Hardware count up by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWUP_EVT:                  Hardware count up by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_HWUP_OVERFLOW:             Hardware count up by overflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 *           @arg TIMERB_HWUP_UNDERFLOW:            Hardware count up by underflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 * @retval  None
 */
void TIMERB_SetHwUpCondition(M0P_TMRB_TypeDef *TMRBx,
                                    uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_HCUP_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCUPR, TMRB_HCUPR_HCUP, u16Condition);
}

/**
 * @brief  Get TimerB hardware up counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_HWUP_INVALID:              Hardware count up is invalid
 *           @arg TIMERB_HWUP_TIMB_T_PWM1_RISING:   Hardware count up by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWUP_TIMB_T_PWM1_FALLING:  Hardware count up by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWUP_EVT:                  Hardware count up by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_HWDOWN_OVERFLOW:           Hardware count up by overflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 *           @arg TIMERB_HWDOWN_UNDERFLOW:          Hardware count up by underflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 */
uint16_t TIMERB_GetHwUpCondition(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

