hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timerb.c
    return READ_REG16_BIT(TMRBx->HCUPR, TMRB_HCUPR_HCUP);
}

/**
 * @brief  Set TimerB hardware down counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Condition            TimerB hardware down counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_HWDOWN_INVALID:             Hardware count down is invalid
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_RISING:  Hardware count down by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_FALLING: Hardware count down by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_EVT:                 Hardware count down by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_HWDOWN_OVERFLOW:            Hardware count down by overflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 *           @arg TIMERB_HWDOWN_UNDERFLOW:           Hardware count down by underflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 * @retval  None
 */
void TIMERB_SetHwDownCondition(M0P_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_HCUP_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCDOR, TMRB_HCDOR_HCDO, u16Condition);
}

/**
 * @brief  Get TimerB hardware down counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_HWDOWN_INVALID:             Hardware count down is invalid
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_RISING:  Hardware count down by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_FALLING: Hardware count down by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_EVT:                 Hardware count down by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_HWDOWN_OVERFLOW:            Hardware count down by overflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 *           @arg TIMERB_HWDOWN_UNDERFLOW:           Hardware count down by underflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 */
uint16_t TIMERB_GetHwDownCondition(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->HCDOR, TMRB_HCDOR_HCDO);
}

/**
 * @brief  Initialize TimerB input capture function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] pstcIcInit              Pointer to a @ref stc_timerb_ic_init_t structure (TMRBx unit input capture function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance or pstcIcInit == NULL
 */
en_result_t TIMERB_IC_Init(M0P_TMRB_TypeDef *TMRBx,
                                const stc_timerb_ic_init_t *pstcIcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance and pstcIcInit */
    if ((IS_TIMERB_INSTANCE(TMRBx)) && (NULL != pstcIcInit))
    {
        /* Check parameters */
        DDL_ASSERT(IS_TIMERB_IC_CAPTURE_CONDITION(pstcIcInit->u16CaptureCondition));
        DDL_ASSERT(IS_TIMERB_IC_NOISE_FILTER_CLKDIV(pstcIcInit->u16NoiseFilterClkDiv));

        MODIFY_REG16(TMRBx->CCONR,                                               \
                     (TMRB_CCONR_CAPMDA   | TMRB_CCONR_HICP |                    \
                      TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP),                \
                     (TIMERB_INPUT_CAPTURE            |                          \
                      pstcIcInit->u16CaptureCondition |                          \
                      pstcIcInit->u16NoiseFilterClkDiv));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_timerb_ic_init_t to default values.
 * @param  [out] pstcIcInit             Pointer to a @ref stc_timerb_ic_init_t structure (TMRBx unit input capture function configuration data structure).
 * @retval None
 */
en_result_t TIMERB_IC_StructInit(stc_timerb_ic_init_t *pstcIcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (NULL != pstcIcInit)
    {
        pstcIcInit->u16NoiseFilterClkDiv = TIMERB_IC_NOFICLKDIV_NONE;
        pstcIcInit->u16CaptureCondition = TIMERB_IC_INVALID;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize TimerB unit input capture.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance
 */
en_result_t TIMERB_IC_DeInit(M0P_TMRB_TypeDef *TMRBx)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance */
    if (IS_TIMERB_INSTANCE(TMRBx))
    {
        /* Configures the registers to reset value. */
        WRITE_REG16(TMRBx->PERAR, 0xFFFFu);
        WRITE_REG16(TMRBx->CCONR, 0x0001u);
        WRITE_REG16(TMRBx->HCONR, 0x0000u);
        WRITE_REG16(TMRBx->HCUPR, 0x0000u);
        WRITE_REG16(TMRBx->HCDOR, 0x0000u);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set TimerB input capture condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Condition            TimerB input capture condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_IC_RISING:     Capture triggered by rising edge on timer input TIMB_<t>_PWM1
 *           @arg TIMERB_IC_FALLING:    Capture triggered by falling edge on timer input TIMB_<t>_PWM1
 *           @arg TIMERB_IC_EVT:        Capture triggered by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_IC_INVALID:    Don't occur capture action
 * @retval None
 */
void TIMERB_IC_SetCaptureCondition(M0P_TMRB_TypeDef *TMRBx,
                                            uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_CAPTURE_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->CCONR, TMRB_CCONR_HICP, u16Condition);
}

/**
 * @brief  Get TimerB input capture condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_IC_RISING:     Capture triggered by rising edge on timer input TIMB_<t>_PWM1
 *           @arg TIMERB_IC_FALLING:    Capture triggered by falling edge on timer input TIMB_<t>_PWM1
 *           @arg TIMERB_IC_EVT:        Capture triggered by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_IC_INVALID:    Don't occur capture action
 */
uint16_t TIMERB_IC_GetCaptureCondition(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->CCONR, TMRB_CCONR_HICP);
}

/**
 * @brief  Set TimerB input capture noise filter clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Div                  TimerB input capture noise filter clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERB_IC_NOFICLKDIV_NONE:    Disable filter
 *           @arg TIMERB_IC_NOFICLKDIV_DIV1:    HCLK
 *           @arg TIMERB_IC_NOFICLKDIV_DIV4:    HCLK/4
 *           @arg TIMERB_IC_NOFICLKDIV_DIV16:   HCLK/16
 *           @arg TIMERB_IC_NOFICLKDIV_DIV64:   HCLK/64
 * @retval None
 */
void TIMERB_IC_SetFilterClkDiv(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_NOISE_FILTER_CLKDIV(u16Div));

    MODIFY_REG16(TMRBx->CCONR, (TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP), u16Div);
}

/**
 * @brief  Get TimerB input capture noise filter clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_IC_NOFICLKDIV_NONE:    Disable filter
 *           @arg TIMERB_IC_NOFICLKDIV_DIV1:    HCLK
 *           @arg TIMERB_IC_NOFICLKDIV_DIV4:    HCLK/4
 *           @arg TIMERB_IC_NOFICLKDIV_DIV16:   HCLK/16
 *           @arg TIMERB_IC_NOFICLKDIV_DIV64:   HCLK/64
 */
uint16_t TIMERB_IC_GetFilterClkDiv(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->CCONR, (TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP));
}

/**
 * @brief  Initialize TimerB output compare function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] pstcOcInit              Pointer to a @ref stc_timerb_oc_init_t structure (TMRBx unit output compare function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance or pstcOcInit == NULL
 */
en_result_t TIMERB_OC_Init(M0P_TMRB_TypeDef *TMRBx,
                                const stc_timerb_oc_init_t *pstcOcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

