hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timerb.c
    /* Check TMRBx instance and pstcOcInit */
    if ((IS_TIMERB_INSTANCE(TMRBx)) && (NULL != pstcOcInit))
    {
        /* Check parameters */
        DDL_ASSERT(IS_TIMERB_OC_PORT_OUTPUT_STATE(pstcOcInit->u16PortOutputState));
        DDL_ASSERT(IS_TIMERB_OC_START_CNT_OUTPUT_POLARITY(pstcOcInit->u16StartCntOutput));
        DDL_ASSERT(IS_TIMERB_OC_STOP_CNT_OUTPUT_POLARITY(pstcOcInit->u16StopCntOutput));
        DDL_ASSERT(IS_TIMERB_OC_CMPMATCH_OUTPUT_POLARITY(pstcOcInit->u16CompareMatchOutput));
        DDL_ASSERT(IS_TIMERB_OC_PERIODMATCH_OUTPUT_POLARITY(pstcOcInit->u16PeriodMatchOutput));

        WRITE_REG16(TMRBx->CMPAR, pstcOcInit->u16CompareVal);
        WRITE_REG16(TMRBx->PCONR,                                              \
                    (pstcOcInit->u16StartCntOutput     |                       \
                     pstcOcInit->u16StopCntOutput      |                       \
                     pstcOcInit->u16CompareMatchOutput |                       \
                     pstcOcInit->u16PeriodMatchOutput  |                       \
                     pstcOcInit->u16PortOutputState));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_timerb_oc_init_t to default values.
 * @param  [out] pstcOcInit             Pointer to a @ref stc_timerb_oc_init_t structure (TMRBx unit output compare function configuration data structure).
 * @retval None
 */
en_result_t TIMERB_OC_StructInit(stc_timerb_oc_init_t *pstcOcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (NULL != pstcOcInit)
    {
        pstcOcInit->u16CompareVal = 0xFFFFu;
        pstcOcInit->u16PortOutputState = TIMERB_OC_PORT_OUTPUT_DISABLE;
        pstcOcInit->u16StartCntOutput = TIMERB_OC_STARTCNT_OUTPUT_LOW;
        pstcOcInit->u16StopCntOutput = TIMERB_OC_STOPCNT_OUTPUT_LOW;
        pstcOcInit->u16CompareMatchOutput = TIMERB_OC_CMPMATCH_OUTPUT_LOW;
        pstcOcInit->u16PeriodMatchOutput = TIMERB_OC_PERIODMATCH_OUTPUT_LOW;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize TimerB unit output compare.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance
 */
en_result_t TIMERB_OC_DeInit(M0P_TMRB_TypeDef *TMRBx)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance */
    if (IS_TIMERB_INSTANCE(TMRBx))
    {
        /* Configures the registers to reset value. */
        WRITE_REG16(TMRBx->PCONR, 0x0000u);
        WRITE_REG16(TMRBx->PERAR, 0xFFFFu);
        WRITE_REG16(TMRBx->CMPAR, 0xFFFFu);
        WRITE_REG16(TMRBx->BCSTR, 0x0000u);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set TIMB_<t>_PWM1 port output polarity when start count.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWM1 port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_LOW     TIM_<t>_PWM1 output low level when TimerB start count
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_HIGH    TIM_<t>_PWM1 output high level when TimerB start count
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_HOLD    TIM_<t>_PWM1 output hold level when TimerB start count
 * @retval None
 */
void TIMERB_OC_SetStartCntOutputPolarity(M0P_TMRB_TypeDef *TMRBx,
                                                    uint16_t u16Polarity)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_OC_START_CNT_OUTPUT_POLARITY(u16Polarity));

    MODIFY_REG16(TMRBx->PCONR, TMRB_PCONR_STAC, u16Polarity);
}

/**
 * @brief  Get TIMB_<t>_PWM1 port output polarity for start count.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_LOW     TIM_<t>_PWM1 output low level when TimerB start count
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_HIGH    TIM_<t>_PWM1 output high level when TimerB start count
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_HOLD    TIM_<t>_PWM1 output hold level when TimerB start count
 */
uint16_t TIMERB_OC_GetStartCntOutputPolarity(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->PCONR, TMRB_PCONR_STAC);
}

/**
 * @brief  Set TIMB_<t>_PWM1 port output polarity for stop count.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWM1 port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_LOW      TIM_<t>_PWM1 output low level when TimerB stop count
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_HIGH     TIM_<t>_PWM1 output high level when TimerB stop count
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_HOLD     TIM_<t>_PWM1 output hold level when TimerB stop count
 * @retval None
 */
void TIMERB_OC_SetStopCntOutputPolarity(M0P_TMRB_TypeDef *TMRBx,
                                                    uint16_t u16Polarity)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_OC_STOP_CNT_OUTPUT_POLARITY(u16Polarity));

    MODIFY_REG16(TMRBx->PCONR, TMRB_PCONR_STPC, u16Polarity);
}

/**
 * @brief  Get TIMB_<t>_PWM1 port output polarity for stop count.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_LOW      TIM_<t>_PWM1 output low level when TimerB stop count
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_HIGH     TIM_<t>_PWM1 output high level when TimerB stop count
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_HOLD     TIM_<t>_PWM1 output hold level when TimerB stop count
 */
uint16_t TIMERB_OC_GetStopCntOutputPolarity(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->PCONR, TMRB_PCONR_STPC);
}

/**
 * @brief  Set TIMB_<t>_PWM1 port output polarity for compare match.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWM1 port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_LOW         TIM_<t>_PWM1 output low level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_HIGH        TIM_<t>_PWM1 output high level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_HOLD        TIM_<t>_PWM1 output hold level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_INVERTED    TIM_<t>_PWM1 output inverted level when TimerB comapre match
 * @retval None
 */
void TIMERB_OC_SetCmpMatchOutputPolarity(M0P_TMRB_TypeDef *TMRBx,
                                                    uint16_t u16Polarity)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_OC_CMPMATCH_OUTPUT_POLARITY(u16Polarity));

    MODIFY_REG16(TMRBx->PCONR, TMRB_PCONR_CMPC, u16Polarity);
}

/**
 * @brief  Get TIMB_<t>_PWM1 port output polarity for compare match.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_LOW         TIM_<t>_PWM1 output low level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_HIGH        TIM_<t>_PWM1 output high level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_HOLD        TIM_<t>_PWM1 output hold level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_INVERTED    TIM_<t>_PWM1 output inverted level when TimerB comapre match
 */
uint16_t TIMERB_OC_GetCmpMatchOutputPolarity(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->PCONR, TMRB_PCONR_CMPC);
}

/**
 * @brief  Set TIMB_<t>_PWM1 port output polarity for period match.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWM1 port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_LOW          TIM_<t>_PWM1 output low level when TimerB period match
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_HIGH         TIM_<t>_PWM1 output high level when TimerB period match
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_HOLD         TIM_<t>_PWM1 output hold level when TimerB period match
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_INVERTED     TIM_<t>_PWM1 output inverted level when TimerB period match
 * @retval None
 */
void TIMERB_OC_SetPeriodMatchOutputPolarity(M0P_TMRB_TypeDef *TMRBx,
                                                        uint16_t u16Polarity)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_OC_PERIODMATCH_OUTPUT_POLARITY(u16Polarity));

    MODIFY_REG16(TMRBx->PCONR, TMRB_PCONR_PERC, u16Polarity);
}

/**
 * @brief  Get TIMB_<t>_PWM1 port output polarity for period match.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_LOW          TIM_<t>_PWM1 output low level when TimerB period match
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_HIGH         TIM_<t>_PWM1 output high level when TimerB period match
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_HOLD         TIM_<t>_PWM1 output hold level when TimerB period match
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_INVERTED     TIM_<t>_PWM1 output inverted level when TimerB period match
 */
uint16_t TIMERB_OC_GetPeriodMatchOutputPolarity(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

