hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_timerb.c
    return READ_REG16_BIT(TMRBx->PCONR, TMRB_PCONR_PERC);
}

/**
 * @brief  Set TIMB_<t>_PWM1 port output polarity for force.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWM1 port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERB_OC_FORCE_OUTPUT_LOW        Force TIM_<t>_PWM1 output low level
 *           @arg TIMERB_OC_FORCE_OUTPUT_HIGH       Force TIM_<t>_PWM1 output high level
 *           @arg TIMERB_OC_FORCE_OUTPUT_INVALID    Force invalid
 * @retval None
 */
void TIMERB_OC_SetForceOutputPolarity(M0P_TMRB_TypeDef *TMRBx,
                                                uint16_t u16Polarity)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_OC_FORCE_OUTPUT_POLARITY(u16Polarity));

    MODIFY_REG16(TMRBx->PCONR, TMRB_PCONR_FORC, u16Polarity);
}

/**
 * @brief  Get TIMB_<t>_PWM1 port output polarity for force.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_OC_FORCE_OUTPUT_LOW        Force TIM_<t>_PWM1 output low level
 *           @arg TIMERB_OC_FORCE_OUTPUT_HIGH       Force TIM_<t>_PWM1 output high level
 *           @arg TIMERB_OC_FORCE_OUTPUT_INVALID    Force invalid
 */
uint16_t TIMERB_OC_GetForceOutputPolarity(M0P_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->PCONR, TMRB_PCONR_FORC);
}

/**
 * @}
 */

#endif /* DDL_TIMERB_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
